{
  "29th & Diamond Open Space": {
    "Rating": 1,
    "Remarks": "Yet another patch of grass that looks into some houses. Except this one was half torn down for construction."
  },
  "Alamo Square": {
    "Rating": 4,
    "Remarks": "Would be 5 stars except except too many tourists. Of course there are the painted ladies as well."
  },
  "Aquatic Park Historic District": {
    "Rating": 5,
    "Remarks": "Seems a bit touristy but this place is just awesome. Love to swim here. Apparently there's yoga on Sundays as well."
  },
  "Baden-Joost Mini Park": {
    "Rating": 5,
    "Remarks": "Earns its mini park name. Quite nice set of stairs. Lots of different flowers and smells. Not a straight stair down either - nice curves giving impression denser illusion. Definitely check out Sunnyside Conservatory near by."
  },
  "Billy Goat Hill": {
    "Rating": 5,
    "Remarks": "Small but amazing spot overlooking the city. Sunset views are incredible. I also proposed here!"
  },
  "Bernal Heights Park": {
    "Rating": 5,
    "Remarks": "Another classic spot in the city with great views and a paved trail up."
  },
  "Bosworth Street Open Space": {
    "Rating": 1,
    "Remarks": "Not sure how this qualifies as a park. I tried to eat a sandwich here before and there's not even anywhere to sit down."
  },
  "Dorothy W. Erskine Park": {
    "Rating": 3,
    "Remarks": "Nice panoramic views of the city. At top it's not much more than large dog park. But nice foliage."
  },
  "Douglass Playground": {
    "Rating": 4,
    "Remarks": "It's technically one park but it's split into two sections. On the upper side is the dog park. Quite nice - lots of trees circling a large field. On the lower side, some tennis courts and grass area. Felt a lot like golden gate park, except with some steep cliffs. Who know this could be in SF?!"
  },
  "Duncan-Castro Open Space": {
    "Rating": 3,
    "Remarks": "Rough patch of grass. But nice view of Sutro tower. It would have a nice city view but there's some unfortunately placed trees which block the most interesting bits."
  },
  "Embarcadero Plaza": {
    "Rating": 1,
    "Remarks": "The concrete fountain is cool, but this is otherwise not a park. Not much to enjoy except the fountain."
  },
  "Fairmount Open Space": {
    "Rating": 3,
    "Remarks": "Nice quiet spot in residential Glen Park. Has decent views of the city (although any of the houses on this street have better views from indoors)"
  },
  "Fort Mason": {
    "Rating": 4,
    "Remarks": "Lot going on here. Coffee at Equator is good. I find the path from here to Aquatic park a lot nicer."
  },
  "Glen Canyon Park": {
    "Rating": 5,
    "Remarks": "One of my favorites in the city. On some trails it feels like you're in the middle of nowhere. Many good trails to take inside. Grab a banh mi from 'Viking subs' after - best spot in Glen Park IMO."
  },
  "Golden Gate Park": {
    "Rating": 5,
    "Remarks": "Have you really not visited yet?"
  },
  "Hippie Hill": {
    "Rating": 5,
    "Remarks": "Historic spot. Dropped acid here once and watched the drum circle for a few hours."
  },
  "Holly Park": {
    "Rating": 4,
    "Remarks": "Loved how it was both round and elevated. Visited at night."
  },
  "Lake Merced Park": {
    "Rating": 2,
    "Remarks": "Reasonably nice lake. Not very interesting in the winter. Would be a 3 star but the excessive street noise ruin my walks here."
  },
  "Lands End": {
    "Rating": 5,
    "Remarks": "I haven't come here enough. Will need to come back."
  },
  "Marina Green": {
    "Rating": 3,
    "Remarks": "This place seems like it'd be awesome but it's just OK. I like biking down the straightaway here."
  },
  "Mount Davidson Park": {
    "Rating": 5,
    "Remarks": "Cross at the top is a bit weird. But otherwise has nice views out to Ocean beach. Feels a bit jungly on one side. Do not go within a few days of rain - gets really muddy. The fog will do that too."
  },
  "Mission Dolores Park": {
    "Rating": 4,
    "Remarks": "Classic, but obviously not very peaceful."
  },
  "Moscone Recreation Center": {
    "Rating": 2,
    "Remarks": "Interesting statues on Laguna street side but otherwise a very generic recreation center."
  },
  "Noe Valley Courts": {
    "Rating": 2,
    "Remarks": "Just a normal park. Lots of dogs. Not much going on except for a tennis court and basketball court."
  },
  "Noe Valley Town Square": {
    "Rating": 2,
    "Remarks": "Not much of a park. They have a nice farmers market here on Saturdays, though."
  },
  "Panhandle": {
    "Rating": 5,
    "Remarks": "Awesome spot in the city. Great place to chill during a bike ride."
  },
  "Potrero Hill Recreation Center": {
    "Rating": 4,
    "Remarks": "Came here often for walks during Covid. Has a bunch of stuff but nothing that really interested me."
  },
  "Precita Park": {
    "Rating": 2,
    "Remarks": "Long strip of grass. There were lights hung on one side which were nice. Other side had construction."
  },
  "Presidio of San Francisco": {
    "Rating": 5,
    "Remarks": "Have you really not visited yet?"
  },
  "Rincon Park": {
    "Rating": 4,
    "Remarks": "Right by the water. Nice spot to relax after visiting farmer's market in Ferry building. Cupid's arrow is a little too large IMO."
  },
  "Starr King Open Space": {
    "Rating": 5,
    "Remarks": "I used to live on this street. Came here a lot during Covid. Excellent spot for a walk. Decent views of the city."
  },
  "Sue Bierman Park": {
    "Rating": 3,
    "Remarks": "Nice quiet park away from busy Ferry building and Embarcadero. Quite nice to bring a sandwich here."
  },
  "Sunnyside Conservatory": {
    "Rating": 5,
    "Remarks": "Just awesome. It's one of those places you could live your entire life in the city and not find. Lit stairs, many different kinds of vegetation. Lots of nice floral smells. Very dense. At the base there's some massive palm trees as well as a nicely preserved historical building. Was locked at night when I visited, but it looked like you could go in."
  },
  "Sunnyside Playground": {
    "Rating": 2,
    "Remarks": "Regular old playground. Felt kind of sterile. Seemed to have an after-school center here."
  },
  "Topaz Open Space": {
    "Rating": 1,
    "Remarks": "This is not a park. It's a 40 degree incline patch of grass you cannot even walk up on."
  },
  "Walter Haas Playground": {
    "Rating": 2,
    "Remarks": "Not much going on. Has a dog park which smells like piss."
  },
  "Yerba Buena Gardens": {
    "Rating": 2,
    "Remarks": "Would be a lot cooler if it was cleaner and had less loitering."
  }
}
